_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗаказНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ЗаказНаПеревозку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ДанныеДоставки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыЗаказаНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ИсполнителиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправленияЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ДанныеДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ДанныеДоставки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_ЗаказНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ИсполнителиДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ИсполнителиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ИсполнителиДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтороннийПеревозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВыборГруппыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВыборГруппыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказахИНакладных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_СтатусыЗаказаНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_СтатусыЗаказаНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗаказНаПеревозку/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет условия продаж в заказе поставщику
//
// Параметры:
//	УсловияЗакупок - Структура - Структура для заполнения
//
Процедура ЗаполнитьУсловияЗакупок(Знач УсловияЗакупок) Экспорт
	
	Если УсловияЗакупок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Валюта               = УсловияЗакупок.Валюта;
	ВалютаВзаиморасчетов = УсловияЗакупок.Валюта;
	
	Если ЗначениеЗаполнено(УсловияЗакупок.Организация) И УсловияЗакупок.Организация <> Организация Тогда
		Организация = УсловияЗакупок.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияЗакупок.Склад) Тогда
		Склад = УсловияЗакупок.Склад;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияЗакупок.Контрагент) И УсловияЗакупок.Контрагент <> Контрагент Тогда
		Контрагент = УсловияЗакупок.Контрагент;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	
	Если ЗначениеЗаполнено(УсловияЗакупок.ХозяйственнаяОперация) Тогда
		ХозяйственнаяОперация = УсловияЗакупок.ХозяйственнаяОперация;
	КонецЕсли;
	
	ХозяйственнаяОперацияДоговора = ?(
		ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет")
		Или ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо"),
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика"),
		ХозяйственнаяОперация);
	
		Если УсловияЗакупок.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияЗакупок.ИспользуютсяДоговорыКонтрагентов Тогда
			
			ДопПараметры = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
			ДопПараметры.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
			ДопПараметры.Налогообложение = НалогообложениеНДС;
			
			Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперацияДоговора,ДопПараметры);
			
		КонецЕсли;
		
	Если ЗначениеЗаполнено(УсловияЗакупок.ГруппаФинансовогоУчета) Тогда
		ГруппаФинансовогоУчета = УсловияЗакупок.ГруппаФинансовогоУчета;
	КонецЕсли;
	
	ЦенаВключаетНДС           = УсловияЗакупок.ЦенаВключаетНДС;
	Если УсловияЗакупок.Свойство("НалогообложениеНДС")Тогда
	НалогообложениеНДС        = УсловияЗакупок.НалогообложениеНДС;
	КонецЕсли;
		
КонецПроцедуры

// Заполняет условия продаж по соглашению в заказе поставщику
//
// Параметры:
//	ПересчитатьЦены - Булево - Истина, если необходимо пересчитать цены в табличной части документа
//
Процедура ЗаполнитьУсловияЗакупокПоCоглашению(ПересчитатьЦены = Истина) Экспорт
	
	УсловияЗакупок = ЗакупкиСервер.ПолучитьУсловияЗакупок(Соглашение, Истина, Истина);
	ЗаполнитьУсловияЗакупок(УсловияЗакупок);
	
КонецПроцедуры

// Заполняет условия закупок по торговому соглашению с поставщиком
//
// Параметры:
//	ПересчитатьЦены - Булево - Истина, если необходимо пересчитать цены в табличной части документа
//
Процедура ЗаполнитьУсловияЗакупокПоУмолчанию(ПересчитатьЦены = Истина) Экспорт
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		
		УсловияЗакупокПоУмолчанию = ЗакупкиСервер.ПолучитьУсловияЗакупокПоУмолчанию(
			Партнер,
			Новый Структура("УчитыватьГруппыСкладов,ИсключитьГруппыСкладовДоступныеВЗаказах,ВыбранноеСоглашение", Истина, Истина, Соглашение));
		
			
		Если УсловияЗакупокПоУмолчанию <> Неопределено Тогда
			
			Если Соглашение <> УсловияЗакупокПоУмолчанию.Соглашение
				И ЗначениеЗаполнено(УсловияЗакупокПоУмолчанию.Соглашение) Тогда
			
				Соглашение = УсловияЗакупокПоУмолчанию.Соглашение;
				ЗаполнитьУсловияЗакупок(УсловияЗакупокПоУмолчанию);
									
			Иначе
				Соглашение = УсловияЗакупокПоУмолчанию.Соглашение;
			КонецЕсли;
						
		Иначе
			
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
			Соглашение = Неопределено;
			
			Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, );
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.УСОERP_ИсполнителиДоставки.СтороннийПеревозчик Тогда
		ПроверяемыеРеквизиты.Добавить("Партнер");
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Если Затраты.Количество()>0 Тогда
		ПроверяемыеРеквизиты.Добавить("Валюта");
		ПроверяемыеРеквизиты.Добавить("ВалютаВзаиморасчетов");
		ПроверяемыеРеквизиты.Добавить("НалогообложениеНДС");
	КонецЕсли;

	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ВыполнитьПроверкуКоличества(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем СкладПоступления;
	Перем РеквизитыШапки;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование")
			И (ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")
			Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив")) Тогда

			ДанныеЗаполнения.Свойство("СкладПоступления", СкладПоступления);
			ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
			ЗаполнитьДокументНаОснованииЗаказаПоставщику(ДанныеЗаполнения.ДокументОснование, СкладПоступления, РеквизитыШапки);

		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаполнитьДокументНаОснованииЗаказаПоставщику(ДанныеЗаполнения, СкладПоступления);
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	//ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ВыполнитьПроверкуСрокаДоставки(Отказ);
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.УСОERP_ЗаказнаПеревозку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	УСОERP_МатериальноТехническоеОбеспечение.ОтразитьДанныеДоставки(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	// ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
	
	//Если Статус = Перечисления.УСОERP_СтатусыЗаказаНаПеревозку.ВРаботе
	//	ИЛИ Статус = Перечисления.УСОERP_СтатусыЗаказаНаПеревозку.Подготовлен Тогда
	//	ВыполнитьПроверкуКоличества(Отказ);
	//	РегистрыСведений.УСОERP_Доставка.ОтразитьЗаказНаПеревозку(ЭтотОбъект, Отказ);
	//ИначеЕсли Статус = Перечисления.УСОERP_СтатусыЗаказаНаПеревозку.Отменен Тогда
	//	РегистрыСведений.УСОERP_Доставка.ОтразитьЗаказНаПеревозку(ЭтотОбъект, Отказ, Истина);
	//КонецЕсли;

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ РежимЗаписиДокумента = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ДокументОснование, Знач СкладПоступления = Неопределено, РеквизитыЗаказа = Неопределено)

	ТипОснования = ТипЗнч(ДокументОснование);
	ЗаполнятьПоОстаткам = Ложь;
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Сделка КАК Сделка,
		|	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
		|	ЗаказПоставщику.Партнер КАК Партнер,
		|	ЗаказПоставщику.Контрагент КАК Контрагент,
		|	ЗаказПоставщику.Договор КАК Договор,
		|	ЗаказПоставщику.Организация КАК Организация,
		|	ЗаказПоставщику.Соглашение КАК Соглашение,
		|	ЗаказПоставщику.Валюта КАК Валюта,
		|	ЗаказПоставщику.Валюта КАК ВалютаВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Склад.ЭтоГруппа
		|				И ЗаказПоставщику.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ ЗаказПоставщику.Склад
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Склад.ЭтоГруппа
		|				И ЗаказПоставщику.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
		|	ЗаказПоставщику.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаказПоставщику.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность,
		|	ЗаказПоставщику.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗаказПоставщику.Статус КАК СтатусДокумента,
		|	ЗаказПоставщику.Подразделение КАК Подразделение,
		|	НЕ ЗаказПоставщику.Проведен КАК ЕстьОшибкиПроведен,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден)
		|				ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &ДокументОснование
		// Регистр сведений УСОERP_Доставка удален!
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	УСОERP_ДоставкаСрезПоследних.ЗаказПоставщику,
		//|	УСОERP_ДоставкаСрезПоследних.Номенклатура,
		//|	УСОERP_ДоставкаСрезПоследних.Характеристика,
		//|	УСОERP_ДоставкаСрезПоследних.ЗаказНаПеревозку
		//|ПОМЕСТИТЬ ВТ_ЗаказыНаПеревозку
		//|ИЗ
		//|	РегистрСведений.УСОERP_Доставка.СрезПоследних(, ЗаказПоставщику = &ДокументОснование) КАК УСОERP_ДоставкаСрезПоследних
		//|ГДЕ
		//|	УСОERP_ДоставкаСрезПоследних.ЗаказНаПеревозку <> ЗНАЧЕНИЕ(Документ.УСОERP_ЗаказНаПеревозку.пустаяСсылка)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЗаказыНаПеревозку.ЗаказПоставщику,
		//|	ВТ_ЗаказыНаПеревозку.Номенклатура,
		//|	ВТ_ЗаказыНаПеревозку.Характеристика,
		//|	ВТ_ЗаказыНаПеревозку.ЗаказНаПеревозку,
		//|	СУММА(ЕСТЬNULL(УСОERP_ЗаказНаПеревозкуКДоставке.Количество, 0)) КАК КоличествоНедоступно
		//|ПОМЕСТИТЬ ВТ_ЗарезервированноеКоличество
		//|ИЗ
		//|	ВТ_ЗаказыНаПеревозку КАК ВТ_ЗаказыНаПеревозку
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ЗаказНаПеревозку.КДоставке КАК УСОERP_ЗаказНаПеревозкуКДоставке
		//|		ПО ВТ_ЗаказыНаПеревозку.ЗаказНаПеревозку = УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка
		//|			И ВТ_ЗаказыНаПеревозку.ЗаказПоставщику = УСОERP_ЗаказНаПеревозкуКДоставке.ЗаказПоставщику
		//|			И ВТ_ЗаказыНаПеревозку.Номенклатура = УСОERP_ЗаказНаПеревозкуКДоставке.Номенклатура
		//|			И ВТ_ЗаказыНаПеревозку.Характеристика = УСОERP_ЗаказНаПеревозкуКДоставке.Характеристика
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЗаказыНаПеревозку.Характеристика,
		//|	ВТ_ЗаказыНаПеревозку.ЗаказНаПеревозку,
		//|	ВТ_ЗаказыНаПеревозку.ЗаказПоставщику,
		//|	ВТ_ЗаказыНаПеревозку.Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЗарезервированноеКоличество.ЗаказПоставщику,
		//|	ВТ_ЗарезервированноеКоличество.Номенклатура,
		//|	ВТ_ЗарезервированноеКоличество.Характеристика,
		//|	СУММА(ВТ_ЗарезервированноеКоличество.КоличествоНедоступно) КАК КоличествоНедоступно
		//|ПОМЕСТИТЬ ВТ_ДанныеПоТоварам
		//|ИЗ
		//|	ВТ_ЗарезервированноеКоличество КАК ВТ_ЗарезервированноеКоличество
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЗарезервированноеКоличество.Номенклатура,
		//|	ВТ_ЗарезервированноеКоличество.ЗаказПоставщику,
		//|	ВТ_ЗарезервированноеКоличество.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		//|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0) - ЕСТЬNULL(ВТ_ДанныеПоТоварам.КоличествоНедоступно, 0) КАК Количество,
		|	ЗаказПоставщикуТовары.Количество,
		|	ЗаказПоставщикуТовары.ДатаПоступления КАК СрокДоставки,
		|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
		|	ЗаказПоставщикуТовары.Упаковка
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоТоварам КАК ВТ_ДанныеПоТоварам
		//|		ПО ЗаказПоставщикуТовары.Ссылка = ВТ_ДанныеПоТоварам.ЗаказПоставщику
		//|			И ЗаказПоставщикуТовары.Номенклатура = ВТ_ДанныеПоТоварам.Номенклатура
		//|			И ЗаказПоставщикуТовары.Характеристика = ВТ_ДанныеПоТоварам.Характеристика
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ДокументОснование
		//|	И ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0) - ЕСТЬNULL(ВТ_ДанныеПоТоварам.КоличествоНедоступно, 0) > 0";
		|	ЗаказПоставщикуТовары.Количество";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();
		
		МассивДопустимыхСтатусов = Новый Массив();
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
		
		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
			РеквизитыЗаказа.ЗаказПоставщику,
			РеквизитыЗаказа.СтатусДокумента,
			РеквизитыЗаказа.ЕстьОшибкиПроведен,
			РеквизитыЗаказа.ЕстьОшибкиСтатус,
			МассивДопустимыхСтатусов);
		
		// Заполнение шапки.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);
		
		// Заполнение материалов  		
		//МатериалыЗаказа = РезультатЗапроса[4].Выгрузить();
		МатериалыЗаказа = РезультатЗапроса[1].Выгрузить();
		
		//Если МатериалыЗаказа.Количество() = 0 Тогда
		//	ТекстОшибки = НСтр("ru='Для материалов к доставке в заказе поставщику уже определены заказы на перевозку, доступного количества по материалам нет. Ввод на основании недоступен.'");
		//			
		//	ВызватьИсключение ТекстОшибки;
		//КонецЕсли;
	
			
		КДоставке.Загрузить( МатериалыЗаказа);
		
		СтруктураДействий = Новый Структура;
		//СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу");
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");		                             
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(КДоставке, СтруктураДействий, Неопределено);

		
		МатериалыЗаказа.Сортировать("СрокДоставки Возр");
		
		Если МатериалыЗаказа.Количество()>0 Тогда
			СрокДоставки =  МатериалыЗаказа[0].СрокДоставки;
		КонецЕсли;
				
	КонецЕсли;
		
		
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный                  = Пользователи.ТекущийПользователь();
	Валюта                         = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
	ВалютаВзаиморасчетов           = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(ВалютаВзаиморасчетов);
	
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Склад                     = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад, Ложь, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ВыполнитьПроверкуКоличества(Отказ = Ложь)
	
	Движения.УСОERP_ДанныеДоставки.Очистить();
	Движения.УСОERP_ДанныеДоставки.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ЗаказПоставщику,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Номенклатура,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Характеристика,
	|	СУММА(УСОERP_ЗаказНаПеревозкуКДоставке.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Количество КАК Количество,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Организация,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресОтправления,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.НомерСтроки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Упаковка
	|ПОМЕСТИТЬ ВТ_ЗаказыИМатериалыВДокументе
	|ИЗ
	|	Документ.УСОERP_ЗаказНаПеревозку.КДоставке КАК УСОERP_ЗаказНаПеревозкуКДоставке
	|ГДЕ
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка = &Ссылка
	|	И УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Отменен)
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Номенклатура,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ЗаказПоставщику,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Характеристика,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Количество,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Организация,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресОтправления,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.НомерСтроки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыИМатериалыВДокументе.НомерСтроки,
	|	ВТ_ЗаказыИМатериалыВДокументе.Номенклатура,
	|	ВТ_ЗаказыИМатериалыВДокументе.Характеристика,
	|	ВТ_ЗаказыИМатериалыВДокументе.Количество,
	|	ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0) - ВТ_ЗаказыИМатериалыВДокументе.Количество < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкаКоличества,
	|	ВТ_ЗаказыИМатериалыВДокументе.АдресОтправления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Числитель, 1) = 0
	|			ТОГДА ВТ_ЗаказыИМатериалыВДокументе.Количество
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ЗаказыИМатериалыВДокументе.Количество * ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Знаменатель, 1) / ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Числитель, 1) КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Числитель, 1) = 0
	|			ТОГДА ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0) * ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Знаменатель, 1) / ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Упаковка.Числитель, 1) КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК КоличествоУпаковокОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_ЗаказыИМатериалыВДокументе.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВТ_ЗаказыИМатериалыВДокументе.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ВТ_ЗаказыИМатериалыВДокументе.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	ВТ_ЗаказыИМатериалыВДокументе КАК ВТ_ЗаказыИМатериалыВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ДанныеДоставки.Остатки(
	|				&КонецПериода,
	|				(ЗаказПоставщику, Организация, Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВТ_ЗаказыИМатериалыВДокументе.ЗаказПоставщику,
	|							ВТ_ЗаказыИМатериалыВДокументе.Организация,
	|							ВТ_ЗаказыИМатериалыВДокументе.Номенклатура,
	|							ВТ_ЗаказыИМатериалыВДокументе.Характеристика
	|						ИЗ
	|							ВТ_ЗаказыИМатериалыВДокументе КАК ВТ_ЗаказыИМатериалыВДокументе)
	|					И ЗаказНаДоставку <> &Ссылка) КАК УСОERP_ДанныеДоставкиОстатки
	|		ПО ВТ_ЗаказыИМатериалыВДокументе.ЗаказПоставщику = УСОERP_ДанныеДоставкиОстатки.ЗаказПоставщику
	|			И ВТ_ЗаказыИМатериалыВДокументе.Характеристика = УСОERP_ДанныеДоставкиОстатки.Характеристика
	|			И ВТ_ЗаказыИМатериалыВДокументе.Номенклатура = УСОERP_ДанныеДоставкиОстатки.Номенклатура
	|			И ВТ_ЗаказыИМатериалыВДокументе.Организация = УСОERP_ДанныеДоставкиОстатки.Организация
	|			И (ВТ_ЗаказыИМатериалыВДокументе.АдресОтправления = УСОERP_ДанныеДоставкиОстатки.АдресОтправления
	|					И УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку = ЗНАЧЕНИЕ(Документ.УСОERP_ЗаказНаПеревозку.ПустаяСсылка)
	|				ИЛИ УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку <> ЗНАЧЕНИЕ(Документ.УСОERP_ЗаказНаПеревозку.ПустаяСсылка)
	|					И ВТ_ЗаказыИМатериалыВДокументе.АдресОтправления = УСОERP_ДанныеДоставкиОстатки.АдресДоставки)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ЗаказыИМатериалыВДокументе.Количество, 0) < 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ИСТИНА";
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(Дата, ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		Возврат;
	Конецесли;
	
	Выборка = Результат.Выбрать();
	
	ТекстОшибки = "";
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = "Для материала " + Выборка.Номенклатура + ?(ЗначениеЗаполнено(Выборка.Характеристика), ", " + Выборка.Характеристика, "")
					+ " количество к доставке " + Строка(Выборка.КоличествоУпаковок) + " " + СокрЛП(Выборка.Упаковка) 
					+ " превысило доступный остаток материала для заказа на перевозку " + Строка(Выборка.КоличествоУпаковокОстаток) + " " + СокрЛП(Выборка.Упаковка) 
					+ " по адресу отправления: " + СокрЛП(Выборка.АдресОтправления) + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КДоставке", Выборка.НомерСтроки, "Номенклатура"));
		
	КонецЦикла;
	
	
	Отказ = Истина;	
	
КонецПроцедуры

Процедура ВыполнитьПроверкуСрокаДоставки(Отказ = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&СрокДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ЗаказПоставщику,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Номенклатура,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Характеристика,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.НомерСтроки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ДатаПоступления
	|ПОМЕСТИТЬ ВТ_ТаблицаДоставки
	|ИЗ
	|	&КДоставке КАК УСОERP_ЗаказНаПеревозкуКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДоставки.СрокДоставки,
	|	ВТ_ТаблицаДоставки.ЗаказПоставщику,
	|	ВТ_ТаблицаДоставки.Номенклатура,
	|	ВТ_ТаблицаДоставки.Характеристика,
	|	ВТ_ТаблицаДоставки.НомерСтроки,
	|	ВТ_ТаблицаДоставки.ДатаПоступления
	|ИЗ
	|	ВТ_ТаблицаДоставки КАК ВТ_ТаблицаДоставки
	|ГДЕ
	|	ВТ_ТаблицаДоставки.СрокДоставки > ВТ_ТаблицаДоставки.ДатаПоступления";
	Запрос.УстановитьПараметр("СрокДоставки", СрокДоставки);
	Запрос.УстановитьПараметр("КДоставке", КДоставке.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой()Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Срок доставки " + Формат(СрокДоставки, "ДЛФ = Д") + " материала " + Выборка.Номенклатура 
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), ", " + Выборка.Характеристика, "") + " превышает его дату поступления " + Формат(Выборка.ДатаПоступления, "ДЛФ=Д") + ".", ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КДоставке", Выборка.НомерСтроки, "Номенклатура"));
		
	КонецЦикла;
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
